Revit 2026 API

# HomeCamera Class

---

A structure that contains information about the camera and view for the Home view orientation stored in the model.

SystemObject Autodesk.Revit.DBHomeCamera

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public class HomeCamera : IDisposable
```
```vb
Public Class HomeCamera
	Implements IDisposable
```
```cpp
public ref class HomeCamera : IDisposable
```
```fsharp
type HomeCamera =
    class
        interface IDisposable
    end
```

The HomeCamera type exposes the following members.

|  | Name | Description |
| --- | --- | --- |
|  | HomeCamera | Constructs a new copy of the input HomeCamera object. |

|  | Name | Description |
| --- | --- | --- |
|  | BottomAngleOfFieldOfView | The bottom angle of the field of view. |
|  | Center | The zoom or orbit center. |
|  | EyePosition | The eye position point. |
|  | IsValidObject | Specifies whether the .NET object represents a valid Revit entity. |
|  | LeftAngleOfFieldOfView | The left angle of the field of view. |
|  | OrthogonalProjectionHeight | The height of orthogonal projection view volume. |
|  | OrthogonalProjectionWidth | The width of orthogonal projection view volume. |
|  | Pivot | The pivot point. |
|  | RightAngleOfFieldOfView | The right angle of the field of view. |
|  | TopAngleOfFieldOfView | The top angle of the field of view. |
|  | UpDirection | The up direction vector. |
|  | ViewId | The id of the view which is associated to this document's Home view orientation. |

|  | Name | Description |
| --- | --- | --- |
|  | Dispose | Releases all resources used by the HomeCamera |
|  | Equals | Determines whether the specified object is equal to the current object.(Inherited from Object) |
|  | GetHashCode | Serves as the default hash function.(Inherited from Object) |
|  | GetType | Gets the Type of the current instance.(Inherited from Object) |
|  | ToString | Returns a string that represents the current object.(Inherited from Object) |

#### Reference

Autodesk.Revit.DB Namespace